In [2]:
# Q1. list of five function of the pandas library with example

In [2]:
import pandas as pd

In [3]:
# info(), it is used to give information about dataframe 
# head() , it give top data of the data frame 
#tail(), it give tail data of teh data frame 
#value_counts() , it give the count value of the given attribute in the specific coloumns or rows 
#descrive() , it give the static information regarding the given numeric value in the given data set

In [4]:
df = pd.read_excel("AdventureWorks_Database.xlsx")

In [5]:
df

,Date,DateKey,Year,Quarter,MonthNum,Month,FiscalYear,FiscalQuarter,FiscalMonthNum,FiscalMonth,MonthYear,MonthYearLong,MonthYearNum,WeekdayNum,Weekday,WeekdayWeekend
0,2016-04-03,20160403,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,1,Sun,Weekend
1,2016-04-04,20160404,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,2,Mon,Weekday
2,2016-04-05,20160405,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,3,Tue,Weekday
3,2016-04-06,20160406,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,4,Wed,Weekday
4,2016-04-07,20160407,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,5,Thu,Weekday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1456,2014-06-18,20140618,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,4,Wed,Weekday
1457,2014-06-19,20140619,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,5,Thu,Weekday
1458,2014-06-20,20140620,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,6,Fri,Weekday
1459,2014-06-21,20140621,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,7,Sat,Weekend
1460,2014-06-22,20140622,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,1,Sun,Weekend

In [6]:
# df.set_option("display.max_columns")
pd.set_option("display.max_columns", None)

In [7]:
df.shape

(1461, 16)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            1461 non-null   datetime64[ns]
 1   DateKey         1461 non-null   int64
 2   Year            1461 non-null   int64
 3   Quarter         1461 non-null   object
 4   MonthNum        1461 non-null   int64
 5   Month           1461 non-null   object
 6   FiscalYear      1461 non-null   object
 7   FiscalQuarter   1461 non-null   object
 8   FiscalMonthNum  1461 non-null   int64
 9   FiscalMonth     1461 non-null   object
 10  MonthYear       1461 non-null   object
 11  MonthYearLong   1461 non-null   object
 12  MonthYearNum    1461 non-null   int64
 13  WeekdayNum      1461 non-null   int64
 14  Weekday         1461 non-null   object
 15  WeekdayWeekend  1461 non-null   object
dtypes: datetime64[ns](1), int64(6), object(9)
memory usage: 182.8+ KB

In [9]:
df.head()

,Date,DateKey,Year,Quarter,MonthNum,Month,FiscalYear,FiscalQuarter,FiscalMonthNum,FiscalMonth,MonthYear,MonthYearLong,MonthYearNum,WeekdayNum,Weekday,WeekdayWeekend
0,2016-04-03,20160403,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,1,Sun,Weekend
1,2016-04-04,20160404,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,2,Mon,Weekday
2,2016-04-05,20160405,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,3,Tue,Weekday
3,2016-04-06,20160406,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,4,Wed,Weekday
4,2016-04-07,20160407,2016,Q2,4,Apr,FY2016,FQ4,10,Apr,Apr-16,Apr-2016,201604,5,Thu,Weekday

In [10]:
df.tail()

,Date,DateKey,Year,Quarter,MonthNum,Month,FiscalYear,FiscalQuarter,FiscalMonthNum,FiscalMonth,MonthYear,MonthYearLong,MonthYearNum,WeekdayNum,Weekday,WeekdayWeekend
1456,2014-06-18,20140618,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,4,Wed,Weekday
1457,2014-06-19,20140619,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,5,Thu,Weekday
1458,2014-06-20,20140620,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,6,Fri,Weekday
1459,2014-06-21,20140621,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,7,Sat,Weekend
1460,2014-06-22,20140622,2014,Q2,6,Jun,FY2014,FQ4,12,Jun,Jun-14,Jun-2014,201406,1,Sun,Weekend

In [11]:
df.loc[0:6,"Date"]

0   2016-04-03
1   2016-04-04
2   2016-04-05
3   2016-04-06
4   2016-04-07
5   2016-04-08
6   2016-04-09
Name: Date, dtype: datetime64[ns]

In [12]:
df.iloc[0:6,0:6]

        Date   DateKey  Year Quarter  MonthNum Month
0 2016-04-03  20160403  2016      Q2         4   Apr
1 2016-04-04  20160404  2016      Q2         4   Apr
2 2016-04-05  20160405  2016      Q2         4   Apr
3 2016-04-06  20160406  2016      Q2         4   Apr
4 2016-04-07  20160407  2016      Q2         4   Apr
5 2016-04-08  20160408  2016      Q2         4   Apr

In [13]:
df.count()

Date              1461
DateKey           1461
Year              1461
Quarter           1461
MonthNum          1461
Month             1461
FiscalYear        1461
FiscalQuarter     1461
FiscalMonthNum    1461
FiscalMonth       1461
MonthYear         1461
MonthYearLong     1461
MonthYearNum      1461
WeekdayNum        1461
Weekday           1461
WeekdayWeekend    1461
dtype: int64

In [14]:
df.value_counts("Month")

Month
Aug    124
Dec    124
Jan    124
Jul    124
Mar    124
May    124
Oct    124
Apr    120
Jun    120
Nov    120
Sep    120
Feb    113
Name: count, dtype: int64

In [15]:
df.describe()

,Date,DateKey,Year,MonthNum,FiscalMonthNum,MonthYearNum,WeekdayNum
count,1461,1.461000e+03,1461.000000,1461.000000,1461.000000,1461.000000,1461.000000
mean,2016-01-01 00:00:00,2.015567e+07,2015.500342,6.522930,6.477755,201556.557153,4.002053
min,2014-01-01 00:00:00,2.014010e+07,2014.000000,1.000000,1.000000,201401.000000,1.000000
25%,2015-01-01 00:00:00,2.015010e+07,2015.000000,4.000000,3.000000,201501.000000,2.000000
50%,2016-01-01 00:00:00,2.016010e+07,2016.000000,7.000000,6.000000,201601.000000,4.000000
75%,2016-12-31 00:00:00,2.016123e+07,2016.000000,10.000000,9.000000,201612.000000,6.000000
max,2017-12-31 00:00:00,2.017123e+07,2017.000000,12.000000,12.000000,201712.000000,7.000000
std,NaN,1.118630e+04,1.118111,3.449884,3.459999,111.862876,2.001197

In [16]:
# Q2 given a pandas data frame df with columns "a", "b" , "c" write a python function to

In [17]:
df1 = pd.DataFrame({"A":[1,2,3,4],"B":[0,9,8,7],"c":[23,43,45,3]})

In [18]:
df1["value"] = [10,20,30,40]

In [19]:
nex_index = pd.Series([x for x in range(1,2 *  len(df1)+1 , 2)], name = "nex_index")

In [20]:
df2 = df1.reset_index(drop = True).set_index(nex_index)

In [21]:
df2

           A  B   c  value
nex_index
1          1  0  23     10
3          2  9  43     20
5          3  8  45     30
7          4  7   3     40

In [22]:
def sum_of_head(df1):
    n = 3
    sum = 0 
    for i in range(0,n):
        sum = sum + df1.loc[i,"c"]
    print(sum)

In [23]:
sum_of_head(df1)

111

In [24]:
df1

   A  B   c  value
0  1  0  23     10
1  2  9  43     20
2  3  8  45     30
3  4  7   3     40

In [25]:
b= df1["c"]

In [26]:
df1["value"].loc[0:2].sum()

60

In [27]:
#Q4 given a pandas DataFrame df with a columns "text",write a python function to create a new columns

In [28]:
df1["text"] = ["bhanu ", "ruhi ", "ram ", "seeta"]

In [29]:
df1

   A  B   c  value    text
0  1  0  23     10  bhanu
1  2  9  43     20   ruhi
2  3  8  45     30    ram
3  4  7   3     40   seeta

In [30]:
def count_word(x):
    return len(list(x))

In [31]:
df1["word_count"] = df1["text"].apply(lambda x: count_word(x))

In [32]:
df1

   A  B   c  value    text  word_count
0  1  0  23     10  bhanu            6
1  2  9  43     20   ruhi            5
2  3  8  45     30    ram            4
3  4  7   3     40   seeta           5

In [33]:
len(df1["text"][1].split())

1

In [34]:
df1.size

24

In [35]:
#Q5 How are DataFrame.size() and DataFrame.shape() different?

In [36]:
df1.shape

(4, 6)

In [37]:
df1["email"] = ["bhanu07072002@gmail.com","shivani123@gmail.com","ram098@gmailcom","shyam321@gmail.com"]

In [38]:
df1

   A  B   c  value    text  word_count                    email
0  1  0  23     10  bhanu            6  bhanu07072002@gmail.com
1  2  9  43     20   ruhi            5     shivani123@gmail.com
2  3  8  45     30    ram            4          ram098@gmailcom
3  4  7   3     40   seeta           5       shyam321@gmail.com

In [39]:
def creat_user_name(x):
    return x.split("@")[0]

In [40]:
df1["user_name"] = df1["email"].apply(lambda x : creat_user_name(x))

In [41]:
df1

   A  B   c  value    text  word_count                    email      user_name
0  1  0  23     10  bhanu            6  bhanu07072002@gmail.com  bhanu07072002
1  2  9  43     20   ruhi            5     shivani123@gmail.com     shivani123
2  3  8  45     30    ram            4          ram098@gmailcom         ram098
3  4  7   3     40   seeta           5       shyam321@gmail.com       shyam321

In [42]:
#Q8

In [43]:
a = pd.Series([3,8,6,2,9],name  = "a")
b = pd.Series([5,2,9,3,1],name = "b")
c = pd.Series([1,7,4,5,2], name = "c")

In [44]:
df4 = pd.DataFrame({a.name : a,b.name :b , c.name :c })

In [45]:
df4

   a  b  c
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [46]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df4[df4["a"] > 5 ]

   a  b  c
1  8  2  7
2  6  9  4
4  9  1  2

In [48]:
def new_dataFrame(dataFrame):
    
    filter1 =dataFrame[dataFrame["a"] > 5]
    filter2 =filter1[filter1["b"] < 10 ]
    return filter2

In [49]:
df5 = new_dataFrame(df4)

In [50]:
df5

   a  b  c
1  8  2  7
2  6  9  4
4  9  1  2

In [51]:
df4["value"] = [12,21,34,88,65]

In [52]:
df4

   a  b  c  value
0  3  5  1     12
1  8  2  7     21
2  6  9  4     34
3  2  3  5     88
4  9  1  2     65

In [53]:
df4["value"].mean()

44.0

In [54]:
df4["value"].median()

34.0

In [55]:
df4["value"].std()

31.741140496207755

In [56]:
df1

   A  B   c  value    text  word_count                    email      user_name
0  1  0  23     10  bhanu            6  bhanu07072002@gmail.com  bhanu07072002
1  2  9  43     20   ruhi            5     shivani123@gmail.com     shivani123
2  3  8  45     30    ram            4          ram098@gmailcom         ram098
3  4  7   3     40   seeta           5       shyam321@gmail.com       shyam321

In [57]:
dates = pd.date_range(start = "2023-01-01",end = "2023-01-05")

In [58]:
dff = pd.DataFrame({"date":dates})

In [59]:
dff["date"].dt.dayofweek.map({0:"sunday", 1:"monday",2:"tuesday",3:"wednesday",4:"thusday ",5:"friday", 6:"saturday"})

0     saturday
1       sunday
2       monday
3      tuesday
4    wednesday
Name: date, dtype: object